; domain
(define (domain parking)
 (:requirements :strips :typing  )
 (:types car curb)
 (:predicates 
    (at-curb ?car - car) 
    (at-curb-num ?car - car ?curb - curb)
    (behind-car ?car ?front-car - car)
    (car-clear ?car - car) 
    (curb-clear ?curb - curb)
 )

 

	(:action move-curb-to-curb
		:parameters (?car - car ?curbsrc ?curbdest - curb)
		:precondition (and 
			(car-clear ?car)
			(curb-clear ?curbdest)
			(at-curb-num ?car ?curbsrc)
		)
		:effect (and 
			(not (curb-clear ?curbdest))
			(curb-clear ?curbsrc)
			(at-curb-num ?car ?curbdest)
			(not (at-curb-num ?car ?curbsrc))
                         
		)
	)

	(:action move-curb-to-car
		:parameters (?car - car ?curbsrc - curb ?cardest - car)
		:precondition (and 
			(car-clear ?car)
			(car-clear ?cardest)
			(at-curb-num ?car ?curbsrc)
			(at-curb ?cardest) 
		)
		:effect (and 
			(not (car-clear ?cardest))
			(curb-clear ?curbsrc)
			(behind-car ?car ?cardest)
			(not (at-curb-num ?car ?curbsrc))
			(not (at-curb ?car))
                         
		)
	)

	(:action move-car-to-curb
		:parameters (?car - car ?carsrc - car ?curbdest - curb)
		:precondition (and 
			(car-clear ?car)
			(curb-clear ?curbdest)
			(behind-car ?car ?carsrc)
		)
		:effect (and 
			(not (curb-clear ?curbdest))
			(car-clear ?carsrc)
			(at-curb-num ?car ?curbdest)
			(not (behind-car ?car ?carsrc))
			(at-curb ?car)
                         
		)
	)

	(:action move-car-to-car
		:parameters (?car - car ?carsrc - car ?cardest - car)
		:precondition (and 
			(car-clear ?car)
			(car-clear ?cardest)
			(behind-car ?car ?carsrc)
			(at-curb ?cardest) 
		)
		:effect (and 
			(not (car-clear ?cardest))
			(car-clear ?carsrc)
			(behind-car ?car ?cardest)
			(not (behind-car ?car ?carsrc))
                         
		)
	)
)

; problem
(define   (problem parking)
  (:domain parking)
  (:objects
     car_00  car_01  car_02  car_03  car_04  car_05  car_06  car_07  car_08  car_09  car_10  car_11  car_12  car_13  car_14  car_15  car_16  car_17  car_18  car_19  car_20  car_21  car_22  car_23  car_24  car_25  car_26  car_27 - car
     curb_00 curb_01 curb_02 curb_03 curb_04 curb_05 curb_06 curb_07 curb_08 curb_09 curb_10 curb_11 curb_12 curb_13 curb_14 - curb
  )
  (:init
     
    (at-curb car_09)
    (at-curb-num car_09 curb_00)
    (behind-car car_21 car_09)
    (car-clear car_21)
    (at-curb car_07)
    (at-curb-num car_07 curb_01)
    (behind-car car_06 car_07)
    (car-clear car_06)
    (at-curb car_22)
    (at-curb-num car_22 curb_02)
    (behind-car car_02 car_22)
    (car-clear car_02)
    (at-curb car_15)
    (at-curb-num car_15 curb_03)
    (behind-car car_24 car_15)
    (car-clear car_24)
    (at-curb car_05)
    (at-curb-num car_05 curb_04)
    (behind-car car_17 car_05)
    (car-clear car_17)
    (at-curb car_12)
    (at-curb-num car_12 curb_05)
    (behind-car car_14 car_12)
    (car-clear car_14)
    (at-curb car_23)
    (at-curb-num car_23 curb_06)
    (behind-car car_26 car_23)
    (car-clear car_26)
    (at-curb car_10)
    (at-curb-num car_10 curb_07)
    (behind-car car_20 car_10)
    (car-clear car_20)
    (at-curb car_19)
    (at-curb-num car_19 curb_08)
    (behind-car car_16 car_19)
    (car-clear car_16)
    (at-curb car_25)
    (at-curb-num car_25 curb_09)
    (behind-car car_13 car_25)
    (car-clear car_13)
    (at-curb car_04)
    (at-curb-num car_04 curb_10)
    (behind-car car_08 car_04)
    (car-clear car_08)
    (at-curb car_00)
    (at-curb-num car_00 curb_11)
    (behind-car car_27 car_00)
    (car-clear car_27)
    (at-curb car_01)
    (at-curb-num car_01 curb_12)
    (behind-car car_11 car_01)
    (car-clear car_11)
    (at-curb car_03)
    (at-curb-num car_03 curb_13)
    (car-clear car_03)
    (at-curb car_18)
    (at-curb-num car_18 curb_14)
    (car-clear car_18)
  )
  (:goal
    (and
      (at-curb-num car_00 curb_00)
      (behind-car car_15 car_00)
      (at-curb-num car_01 curb_01)
      (behind-car car_16 car_01)
      (at-curb-num car_02 curb_02)
      (behind-car car_17 car_02)
      (at-curb-num car_03 curb_03)
      (behind-car car_18 car_03)
      (at-curb-num car_04 curb_04)
      (behind-car car_19 car_04)
      (at-curb-num car_05 curb_05)
      (behind-car car_20 car_05)
      (at-curb-num car_06 curb_06)
      (behind-car car_21 car_06)
      (at-curb-num car_07 curb_07)
      (behind-car car_22 car_07)
      (at-curb-num car_08 curb_08)
      (behind-car car_23 car_08)
      (at-curb-num car_09 curb_09)
      (behind-car car_24 car_09)
      (at-curb-num car_10 curb_10)
      (behind-car car_25 car_10)
      (at-curb-num car_11 curb_11)
      (behind-car car_26 car_11)
      (at-curb-num car_12 curb_12)
      (behind-car car_27 car_12)
      (at-curb-num car_13 curb_13)
      (at-curb-num car_14 curb_14)
    )
  )
 
)
; =========== INIT =========== 
;  curb_00: car_09 car_21 
;  curb_01: car_07 car_06 
;  curb_02: car_22 car_02 
;  curb_03: car_15 car_24 
;  curb_04: car_05 car_17 
;  curb_05: car_12 car_14 
;  curb_06: car_23 car_26 
;  curb_07: car_10 car_20 
;  curb_08: car_19 car_16 
;  curb_09: car_25 car_13 
;  curb_10: car_04 car_08 
;  curb_11: car_00 car_27 
;  curb_12: car_01 car_11 
;  curb_13: car_03 
;  curb_14: car_18 
; ========== /INIT =========== 

; =========== GOAL =========== 
;  curb_00: car_00 car_15 
;  curb_01: car_01 car_16 
;  curb_02: car_02 car_17 
;  curb_03: car_03 car_18 
;  curb_04: car_04 car_19 
;  curb_05: car_05 car_20 
;  curb_06: car_06 car_21 
;  curb_07: car_07 car_22 
;  curb_08: car_08 car_23 
;  curb_09: car_09 car_24 
;  curb_10: car_10 car_25 
;  curb_11: car_11 car_26 
;  curb_12: car_12 car_27 
;  curb_13: car_13 
;  curb_14: car_14 
; =========== /GOAL ===========

; plan
1. (move-car-to-car car_27 car_00 car_18)
   deleted: (car-clear car_18) (behind-car car_27 car_00)
   added: (car-clear car_00) (behind-car car_27 car_18)
   goals met: 0 of 28
2. (move-curb-to-car car_00 curb_11 car_03)
   deleted: (car-clear car_03) (at-curb-num car_00 curb_11) (at-curb car_00)
   added: (curb-clear curb_11) (behind-car car_00 car_03)
   goals met: 0 of 28
3. (move-car-to-curb car_21 car_09 curb_11)
   deleted: (curb-clear curb_11) (behind-car car_21 car_09)
   added: (car-clear car_09) (at-curb-num car_21 curb_11) (at-curb car_21)
   goals met: 0 of 28
4. (move-curb-to-car car_09 curb_00 car_21)
   deleted: (car-clear car_21) (at-curb-num car_09 curb_00) (at-curb car_09)
   added: (curb-clear curb_00) (behind-car car_09 car_21)
   goals met: 0 of 28
5. (move-car-to-curb car_00 car_03 curb_00)
   deleted: (curb-clear curb_00) (behind-car car_00 car_03)
   added: (car-clear car_03) (at-curb-num car_00 curb_00) (at-curb car_00)
   goals met: 1 of 28
6. (move-car-to-car car_24 car_15 car_03)
   deleted: (car-clear car_03) (behind-car car_24 car_15)
   added: (car-clear car_15) (behind-car car_24 car_03)
   goals met: 1 of 28
7. (move-curb-to-car car_15 curb_03 car_00)
   deleted: (car-clear car_00) (at-curb-num car_15 curb_03) (at-curb car_15)
   added: (curb-clear curb_03) (behind-car car_15 car_00)
   goals met: 2 of 28
8. (move-car-to-curb car_11 car_01 curb_03)
   deleted: (curb-clear curb_03) (behind-car car_11 car_01)
   added: (car-clear car_01) (at-curb-num car_11 curb_03) (at-curb car_11)
   goals met: 2 of 28
9. (move-curb-to-car car_01 curb_12 car_11)
   deleted: (car-clear car_11) (at-curb-num car_01 curb_12) (at-curb car_01)
   added: (curb-clear curb_12) (behind-car car_01 car_11)
   goals met: 2 of 28
10. (move-car-to-curb car_06 car_07 curb_12)
   deleted: (curb-clear curb_12) (behind-car car_06 car_07)
   added: (car-clear car_07) (at-curb-num car_06 curb_12) (at-curb car_06)
   goals met: 2 of 28
11. (move-curb-to-car car_07 curb_01 car_06)
   deleted: (car-clear car_06) (at-curb-num car_07 curb_01) (at-curb car_07)
   added: (curb-clear curb_01) (behind-car car_07 car_06)
   goals met: 2 of 28
12. (move-car-to-curb car_01 car_11 curb_01)
   deleted: (curb-clear curb_01) (behind-car car_01 car_11)
   added: (car-clear car_11) (at-curb-num car_01 curb_01) (at-curb car_01)
   goals met: 3 of 28
13. (move-car-to-car car_16 car_19 car_01)
   deleted: (car-clear car_01) (behind-car car_16 car_19)
   added: (car-clear car_19) (behind-car car_16 car_01)
   goals met: 4 of 28
14. (move-car-to-car car_02 car_22 car_19)
   deleted: (car-clear car_19) (behind-car car_02 car_22)
   added: (car-clear car_22) (behind-car car_02 car_19)
   goals met: 4 of 28
15. (move-curb-to-car car_22 curb_02 car_11)
   deleted: (car-clear car_11) (at-curb-num car_22 curb_02) (at-curb car_22)
   added: (curb-clear curb_02) (behind-car car_22 car_11)
   goals met: 4 of 28
16. (move-car-to-curb car_02 car_19 curb_02)
   deleted: (curb-clear curb_02) (behind-car car_02 car_19)
   added: (car-clear car_19) (at-curb-num car_02 curb_02) (at-curb car_02)
   goals met: 5 of 28
17. (move-car-to-car car_17 car_05 car_02)
   deleted: (car-clear car_02) (behind-car car_17 car_05)
   added: (car-clear car_05) (behind-car car_17 car_02)
   goals met: 6 of 28
18. (move-car-to-car car_24 car_03 car_19)
   deleted: (car-clear car_19) (behind-car car_24 car_03)
   added: (car-clear car_03) (behind-car car_24 car_19)
   goals met: 6 of 28
19. (move-curb-to-car car_03 curb_13 car_05)
   deleted: (car-clear car_05) (at-curb-num car_03 curb_13) (at-curb car_03)
   added: (curb-clear curb_13) (behind-car car_03 car_05)
   goals met: 6 of 28
20. (move-car-to-curb car_22 car_11 curb_13)
   deleted: (curb-clear curb_13) (behind-car car_22 car_11)
   added: (car-clear car_11) (at-curb-num car_22 curb_13) (at-curb car_22)
   goals met: 6 of 28
21. (move-curb-to-car car_11 curb_03 car_22)
   deleted: (car-clear car_22) (at-curb-num car_11 curb_03) (at-curb car_11)
   added: (curb-clear curb_03) (behind-car car_11 car_22)
   goals met: 6 of 28
22. (move-car-to-curb car_03 car_05 curb_03)
   deleted: (curb-clear curb_03) (behind-car car_03 car_05)
   added: (car-clear car_05) (at-curb-num car_03 curb_03) (at-curb car_03)
   goals met: 7 of 28
23. (move-car-to-car car_27 car_18 car_05)
   deleted: (car-clear car_05) (behind-car car_27 car_18)
   added: (car-clear car_18) (behind-car car_27 car_05)
   goals met: 7 of 28
24. (move-curb-to-car car_18 curb_14 car_03)
   deleted: (car-clear car_03) (at-curb-num car_18 curb_14) (at-curb car_18)
   added: (curb-clear curb_14) (behind-car car_18 car_03)
   goals met: 8 of 28
25. (move-car-to-curb car_08 car_04 curb_14)
   deleted: (curb-clear curb_14) (behind-car car_08 car_04)
   added: (car-clear car_04) (at-curb-num car_08 curb_14) (at-curb car_08)
   goals met: 8 of 28
26. (move-curb-to-car car_04 curb_10 car_08)
   deleted: (car-clear car_08) (at-curb-num car_04 curb_10) (at-curb car_04)
   added: (curb-clear curb_10) (behind-car car_04 car_08)
   goals met: 8 of 28
27. (move-car-to-curb car_27 car_05 curb_10)
   deleted: (curb-clear curb_10) (behind-car car_27 car_05)
   added: (car-clear car_05) (at-curb-num car_27 curb_10) (at-curb car_27)
   goals met: 8 of 28
28. (move-curb-to-car car_05 curb_04 car_27)
   deleted: (car-clear car_27) (at-curb-num car_05 curb_04) (at-curb car_05)
   added: (curb-clear curb_04) (behind-car car_05 car_27)
   goals met: 8 of 28
29. (move-car-to-curb car_04 car_08 curb_04)
   deleted: (curb-clear curb_04) (behind-car car_04 car_08)
   added: (car-clear car_08) (at-curb-num car_04 curb_04) (at-curb car_04)
   goals met: 9 of 28
30. (move-car-to-car car_24 car_19 car_08)
   deleted: (car-clear car_08) (behind-car car_24 car_19)
   added: (car-clear car_19) (behind-car car_24 car_08)
   goals met: 9 of 28
31. (move-curb-to-car car_19 curb_08 car_04)
   deleted: (car-clear car_04) (at-curb-num car_19 curb_08) (at-curb car_19)
   added: (curb-clear curb_08) (behind-car car_19 car_04)
   goals met: 10 of 28
32. (move-car-to-curb car_14 car_12 curb_08)
   deleted: (curb-clear curb_08) (behind-car car_14 car_12)
   added: (car-clear car_12) (at-curb-num car_14 curb_08) (at-curb car_14)
   goals met: 10 of 28
33. (move-curb-to-car car_12 curb_05 car_14)
   deleted: (car-clear car_14) (at-curb-num car_12 curb_05) (at-curb car_12)
   added: (curb-clear curb_05) (behind-car car_12 car_14)
   goals met: 10 of 28
34. (move-car-to-curb car_05 car_27 curb_05)
   deleted: (curb-clear curb_05) (behind-car car_05 car_27)
   added: (car-clear car_27) (at-curb-num car_05 curb_05) (at-curb car_05)
   goals met: 11 of 28
35. (move-car-to-car car_20 car_10 car_05)
   deleted: (car-clear car_05) (behind-car car_20 car_10)
   added: (car-clear car_10) (behind-car car_20 car_05)
   goals met: 12 of 28
36. (move-car-to-car car_07 car_06 car_10)
   deleted: (car-clear car_10) (behind-car car_07 car_06)
   added: (car-clear car_06) (behind-car car_07 car_10)
   goals met: 12 of 28
37. (move-curb-to-car car_06 curb_12 car_27)
   deleted: (car-clear car_27) (at-curb-num car_06 curb_12) (at-curb car_06)
   added: (curb-clear curb_12) (behind-car car_06 car_27)
   goals met: 12 of 28
38. (move-car-to-curb car_26 car_23 curb_12)
   deleted: (curb-clear curb_12) (behind-car car_26 car_23)
   added: (car-clear car_23) (at-curb-num car_26 curb_12) (at-curb car_26)
   goals met: 12 of 28
39. (move-curb-to-car car_23 curb_06 car_26)
   deleted: (car-clear car_26) (at-curb-num car_23 curb_06) (at-curb car_23)
   added: (curb-clear curb_06) (behind-car car_23 car_26)
   goals met: 12 of 28
40. (move-car-to-curb car_06 car_27 curb_06)
   deleted: (curb-clear curb_06) (behind-car car_06 car_27)
   added: (car-clear car_27) (at-curb-num car_06 curb_06) (at-curb car_06)
   goals met: 13 of 28
41. (move-car-to-car car_09 car_21 car_27)
   deleted: (car-clear car_27) (behind-car car_09 car_21)
   added: (car-clear car_21) (behind-car car_09 car_27)
   goals met: 13 of 28
42. (move-curb-to-car car_21 curb_11 car_06)
   deleted: (car-clear car_06) (at-curb-num car_21 curb_11) (at-curb car_21)
   added: (curb-clear curb_11) (behind-car car_21 car_06)
   goals met: 14 of 28
43. (move-car-to-curb car_07 car_10 curb_11)
   deleted: (curb-clear curb_11) (behind-car car_07 car_10)
   added: (car-clear car_10) (at-curb-num car_07 curb_11) (at-curb car_07)
   goals met: 14 of 28
44. (move-car-to-car car_24 car_08 car_10)
   deleted: (car-clear car_10) (behind-car car_24 car_08)
   added: (car-clear car_08) (behind-car car_24 car_10)
   goals met: 14 of 28
45. (move-curb-to-car car_07 curb_11 car_08)
   deleted: (car-clear car_08) (at-curb-num car_07 curb_11) (at-curb car_07)
   added: (curb-clear curb_11) (behind-car car_07 car_08)
   goals met: 14 of 28
46. (move-car-to-curb car_24 car_10 curb_11)
   deleted: (curb-clear curb_11) (behind-car car_24 car_10)
   added: (car-clear car_10) (at-curb-num car_24 curb_11) (at-curb car_24)
   goals met: 14 of 28
47. (move-curb-to-car car_10 curb_07 car_24)
   deleted: (car-clear car_24) (at-curb-num car_10 curb_07) (at-curb car_10)
   added: (curb-clear curb_07) (behind-car car_10 car_24)
   goals met: 14 of 28
48. (move-car-to-curb car_07 car_08 curb_07)
   deleted: (curb-clear curb_07) (behind-car car_07 car_08)
   added: (car-clear car_08) (at-curb-num car_07 curb_07) (at-curb car_07)
   goals met: 15 of 28
49. (move-car-to-car car_11 car_22 car_08)
   deleted: (car-clear car_08) (behind-car car_11 car_22)
   added: (car-clear car_22) (behind-car car_11 car_08)
   goals met: 15 of 28
50. (move-curb-to-car car_22 curb_13 car_07)
   deleted: (car-clear car_07) (at-curb-num car_22 curb_13) (at-curb car_22)
   added: (curb-clear curb_13) (behind-car car_22 car_07)
   goals met: 16 of 28
51. (move-car-to-curb car_11 car_08 curb_13)
   deleted: (curb-clear curb_13) (behind-car car_11 car_08)
   added: (car-clear car_08) (at-curb-num car_11 curb_13) (at-curb car_11)
   goals met: 16 of 28
52. (move-curb-to-car car_08 curb_14 car_11)
   deleted: (car-clear car_11) (at-curb-num car_08 curb_14) (at-curb car_08)
   added: (curb-clear curb_14) (behind-car car_08 car_11)
   goals met: 16 of 28
53. (move-car-to-curb car_12 car_14 curb_14)
   deleted: (curb-clear curb_14) (behind-car car_12 car_14)
   added: (car-clear car_14) (at-curb-num car_12 curb_14) (at-curb car_12)
   goals met: 16 of 28
54. (move-curb-to-car car_14 curb_08 car_12)
   deleted: (car-clear car_12) (at-curb-num car_14 curb_08) (at-curb car_14)
   added: (curb-clear curb_08) (behind-car car_14 car_12)
   goals met: 16 of 28
55. (move-car-to-curb car_08 car_11 curb_08)
   deleted: (curb-clear curb_08) (behind-car car_08 car_11)
   added: (car-clear car_11) (at-curb-num car_08 curb_08) (at-curb car_08)
   goals met: 17 of 28
56. (move-car-to-car car_23 car_26 car_08)
   deleted: (car-clear car_08) (behind-car car_23 car_26)
   added: (car-clear car_26) (behind-car car_23 car_08)
   goals met: 18 of 28
57. (move-car-to-car car_13 car_25 car_26)
   deleted: (car-clear car_26) (behind-car car_13 car_25)
   added: (car-clear car_25) (behind-car car_13 car_26)
   goals met: 18 of 28
58. (move-curb-to-car car_25 curb_09 car_11)
   deleted: (car-clear car_11) (at-curb-num car_25 curb_09) (at-curb car_25)
   added: (curb-clear curb_09) (behind-car car_25 car_11)
   goals met: 18 of 28
59. (move-car-to-curb car_09 car_27 curb_09)
   deleted: (curb-clear curb_09) (behind-car car_09 car_27)
   added: (car-clear car_27) (at-curb-num car_09 curb_09) (at-curb car_09)
   goals met: 19 of 28
60. (move-car-to-car car_10 car_24 car_27)
   deleted: (car-clear car_27) (behind-car car_10 car_24)
   added: (car-clear car_24) (behind-car car_10 car_27)
   goals met: 19 of 28
61. (move-curb-to-car car_24 curb_11 car_09)
   deleted: (car-clear car_09) (at-curb-num car_24 curb_11) (at-curb car_24)
   added: (curb-clear curb_11) (behind-car car_24 car_09)
   goals met: 20 of 28
62. (move-car-to-curb car_10 car_27 curb_11)
   deleted: (curb-clear curb_11) (behind-car car_10 car_27)
   added: (car-clear car_27) (at-curb-num car_10 curb_11) (at-curb car_10)
   goals met: 20 of 28
63. (move-car-to-car car_25 car_11 car_27)
   deleted: (car-clear car_27) (behind-car car_25 car_11)
   added: (car-clear car_11) (behind-car car_25 car_27)
   goals met: 20 of 28
64. (move-curb-to-car car_10 curb_11 car_11)
   deleted: (car-clear car_11) (at-curb-num car_10 curb_11) (at-curb car_10)
   added: (curb-clear curb_11) (behind-car car_10 car_11)
   goals met: 20 of 28
65. (move-car-to-curb car_25 car_27 curb_11)
   deleted: (curb-clear curb_11) (behind-car car_25 car_27)
   added: (car-clear car_27) (at-curb-num car_25 curb_11) (at-curb car_25)
   goals met: 20 of 28
66. (move-curb-to-car car_27 curb_10 car_25)
   deleted: (car-clear car_25) (at-curb-num car_27 curb_10) (at-curb car_27)
   added: (curb-clear curb_10) (behind-car car_27 car_25)
   goals met: 20 of 28
67. (move-car-to-curb car_10 car_11 curb_10)
   deleted: (curb-clear curb_10) (behind-car car_10 car_11)
   added: (car-clear car_11) (at-curb-num car_10 curb_10) (at-curb car_10)
   goals met: 21 of 28
68. (move-car-to-car car_27 car_25 car_11)
   deleted: (car-clear car_11) (behind-car car_27 car_25)
   added: (car-clear car_25) (behind-car car_27 car_11)
   goals met: 21 of 28
69. (move-curb-to-car car_25 curb_11 car_10)
   deleted: (car-clear car_10) (at-curb-num car_25 curb_11) (at-curb car_25)
   added: (curb-clear curb_11) (behind-car car_25 car_10)
   goals met: 22 of 28
70. (move-car-to-curb car_14 car_12 curb_11)
   deleted: (curb-clear curb_11) (behind-car car_14 car_12)
   added: (car-clear car_12) (at-curb-num car_14 curb_11) (at-curb car_14)
   goals met: 22 of 28
71. (move-curb-to-car car_12 curb_14 car_14)
   deleted: (car-clear car_14) (at-curb-num car_12 curb_14) (at-curb car_12)
   added: (curb-clear curb_14) (behind-car car_12 car_14)
   goals met: 22 of 28
72. (move-car-to-curb car_27 car_11 curb_14)
   deleted: (curb-clear curb_14) (behind-car car_27 car_11)
   added: (car-clear car_11) (at-curb-num car_27 curb_14) (at-curb car_27)
   goals met: 22 of 28
73. (move-curb-to-car car_11 curb_13 car_27)
   deleted: (car-clear car_27) (at-curb-num car_11 curb_13) (at-curb car_11)
   added: (curb-clear curb_13) (behind-car car_11 car_27)
   goals met: 22 of 28
74. (move-car-to-curb car_12 car_14 curb_13)
   deleted: (curb-clear curb_13) (behind-car car_12 car_14)
   added: (car-clear car_14) (at-curb-num car_12 curb_13) (at-curb car_12)
   goals met: 22 of 28
75. (move-curb-to-car car_14 curb_11 car_12)
   deleted: (car-clear car_12) (at-curb-num car_14 curb_11) (at-curb car_14)
   added: (curb-clear curb_11) (behind-car car_14 car_12)
   goals met: 22 of 28
76. (move-car-to-curb car_11 car_27 curb_11)
   deleted: (curb-clear curb_11) (behind-car car_11 car_27)
   added: (car-clear car_27) (at-curb-num car_11 curb_11) (at-curb car_11)
   goals met: 23 of 28
77. (move-car-to-car car_13 car_26 car_27)
   deleted: (car-clear car_27) (behind-car car_13 car_26)
   added: (car-clear car_26) (behind-car car_13 car_27)
   goals met: 23 of 28
78. (move-curb-to-car car_26 curb_12 car_11)
   deleted: (car-clear car_11) (at-curb-num car_26 curb_12) (at-curb car_26)
   added: (curb-clear curb_12) (behind-car car_26 car_11)
   goals met: 24 of 28
79. (move-car-to-curb car_13 car_27 curb_12)
   deleted: (curb-clear curb_12) (behind-car car_13 car_27)
   added: (car-clear car_27) (at-curb-num car_13 curb_12) (at-curb car_13)
   goals met: 24 of 28
80. (move-curb-to-car car_27 curb_14 car_13)
   deleted: (car-clear car_13) (at-curb-num car_27 curb_14) (at-curb car_27)
   added: (curb-clear curb_14) (behind-car car_27 car_13)
   goals met: 24 of 28
81. (move-car-to-curb car_14 car_12 curb_14)
   deleted: (curb-clear curb_14) (behind-car car_14 car_12)
   added: (car-clear car_12) (at-curb-num car_14 curb_14) (at-curb car_14)
   goals met: 25 of 28
82. (move-curb-to-car car_12 curb_13 car_14)
   deleted: (car-clear car_14) (at-curb-num car_12 curb_13) (at-curb car_12)
   added: (curb-clear curb_13) (behind-car car_12 car_14)
   goals met: 25 of 28
83. (move-car-to-curb car_27 car_13 curb_13)
   deleted: (curb-clear curb_13) (behind-car car_27 car_13)
   added: (car-clear car_13) (at-curb-num car_27 curb_13) (at-curb car_27)
   goals met: 25 of 28
84. (move-curb-to-car car_13 curb_12 car_27)
   deleted: (car-clear car_27) (at-curb-num car_13 curb_12) (at-curb car_13)
   added: (curb-clear curb_12) (behind-car car_13 car_27)
   goals met: 25 of 28
85. (move-car-to-curb car_12 car_14 curb_12)
   deleted: (curb-clear curb_12) (behind-car car_12 car_14)
   added: (car-clear car_14) (at-curb-num car_12 curb_12) (at-curb car_12)
   goals met: 26 of 28
86. (move-car-to-car car_13 car_27 car_14)
   deleted: (car-clear car_14) (behind-car car_13 car_27)
   added: (car-clear car_27) (behind-car car_13 car_14)
   goals met: 26 of 28
87. (move-curb-to-car car_27 curb_13 car_12)
   deleted: (car-clear car_12) (at-curb-num car_27 curb_13) (at-curb car_27)
   added: (curb-clear curb_13) (behind-car car_27 car_12)
   goals met: 27 of 28
88. (move-car-to-curb car_13 car_14 curb_13)
   deleted: (curb-clear curb_13) (behind-car car_13 car_14)
   added: (car-clear car_14) (at-curb-num car_13 curb_13) (at-curb car_13)
   goals met: 28 of 28
